# Negate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UV..::..Negate Method
UV Class See Also
---
Negates this 2-D vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV Negate()
```

Visual Basic
---
```text
Public Function Negate As UV
```

Visual C++
---
```text
public:
UV^ Negate()
```

# ### Return Value
The 2-D vector opposite to this vector.
# Remarks
The negated vector is obtained by changing the sign of each coordinate of this vector.
# See Also
UV Class
Autodesk.Revit.DB Namespace